{
    "Hi, my name is": "Привет, меня зовут",
    "Denis Vishnevski": "Денис Вишневский",
    "I'm a front-end developer": "я фронтенд-разработчик",
    "Contact with me": "Свяжитесь со мной",
    "PROJECTS": "ПРОЕКТЫ",
    "SKILLS": "НАВЫКИ",
    "CONTACTS": "КОНТАКТЫ",

    "About me": "Обо мне",
    "aboutMe_block1": "Меня всегда интересовали компьютеры и разная техника, но начал я профессиональный путь в другой сфере. Хотя не учился ни дня в музыкальной школе, я начал самостоятельно заниматься музыкой и уже спустя год поступил в музыкальный колледж.",
    "aboutMe_block2": "В колледже я искал себя в разных сферах: два года работал звукооператором, играл в симфоническом оркестре, а в качестве хобби изучал C# и разрабатывал гиперказуальные игры на Unity. Я очень люблю учиться чему-то новому и именно поэтому выбрал веб-разработку.",
    "aboutMe_block3": "Каждый день стараюсь улучшать свои навыки, стремлюсь писать хорошо читаемый и легко поддерживаемый код. Я всегда открыт для чего-то нового и готов решать самые сложные задачи, чтобы продолжать развиваться в своей профессии.",

    "Skills": "Навыки",
    "Layouting": "Вёрстка",
    "Programming": "Программирование",
    "More": "Ещё",
    "HTML_skill" : "Стремлюсь к написанию семантического HTML кода и понятных названий классов.",
    "CSS_skill": "При адаптации сайта под разные устройсва по возможности использую такие функции как min(), max() и clamp(), которые помогают избавиться от лишних медиа-запросов.",
    "SASS_skill": "Этот сайт я написал с использованием SASS, нашел для себя много преимущества использования препроцессоров перед css.",
    "LESS_skill": "При помощи LESS я написал ",
    "LESS_skill_link": "Приложение для заметок.",
    "Tailwind_skill": "Разрабатывал CRM-систему для клиники, где использовал Tailwind. Нашел для себя как плюсы так и минусы использования фреймворка.",
    "JavaScript_skill": "Использовал в своих проектах на практике большую часть всех возможностей ES6+.",
    "TypeScript_skill": "Так как до этого изучал C#, и привык к статической типизации, я быстро разобрался в TypeScript. Использую его в большинстве своих проектов.",
    "React_skill": "Стараюсь строить удобную для разработчиков и легко поддерживаемую архитектору приложений.",
    "Redux_skill": "Использовал Redux при создании ",
    "Redux_skill_link": "Лендинга для фотографа. ",
    "Redux_slill2": "Также использовал Redux-Thunk библиотеку при разработке CRM-системы для клиники.",
    "REST_skill": "Понимаю принципы REST API, есть опыт работы с RESTful приложениями.",
    "Figma_skill": "Умею экспортировать изображения, работать со слоями, стилями, вкладкой Inspect. При необходимости могу внести правки в макет.",
    "C#_skill": "Больше двух лет изучал C#. В качестве хобби пишу гиперказуальные игры на Unity.",
    "ASP.NET_slill": "Имею базовые знания для работы с ASP.NET Core, могу написать простое веб-приложение.",

    "Portfolio": "Портфолио",
    "ToDo list": "Приложение для заметок",
    "Landing for a photographer": "Лендинг для фотографа",
    "Personal portfolio website": "Личный сайт-портфолио",
    "Go to website": "Перейти на сайт",

    "Contacts": "Контакты",

    "Website design": "Дизайн сайта"
}